/*
***********************************************************************************
*                    作    者: 徐松亮
*                    更新时间: 2015-06-03
***********************************************************************************
*/
#ifndef __LIB_QRXSLTEST_H
#define __LIB_QRXSLTEST_H
//-------------------加载库函数------------------------------
#include "includes.h"
//-------------------接口宏定义(硬件相关)--------------------
#define  QR_XSL_EMWIN_ENABLE
#define  QR_XSL_LCD_XSIZE  320
#define  QR_XSL_LCD_YSIZE  240
//-------------------接口宏定义(硬件无关)--------------------
#ifdef QR_XSL_EMWIN_ENABLE
#include "GUI.h"
#endif
//-------------------接口变量--------------------------------
extern const uint8_t QrXslTest_Str[];
//-------------------接口函数--------------------------------
extern void QR_Xsl_DisplayApp(int16_t xpos,int16_t ypos,uint8_t *qrcode_data);
//-----------------------------------------------------------
#endif
