//-------------------------------------------------------------------------------//
//                    开发环境: RealView MDK-ARM Version 5.10                    //
//                    编 译 器: RealView MDK-ARM Version 5.10                    //
//                    芯片型号: STM32F103ZET6                                    //
//                    项目名称: HH-SPS 安防项目                                  //
//                    文件名称: DNS_Xsl.h                                        //
//                    作    者: 徐松亮                                           //
//                    时    间: 2014-08-07    版本:  0.1                         //
//                    注    意: 只是完成了基本的获取IP,没有完全解析DNS协议,待完善//
//-------------------------------------------------------------------------------//
/*************************************说明*****************************************
**********************************************************************************/
extern void DNSXsl_MakeQuery(uint8_t* pUrlStr,uint8_t* pOutBuf,uint8_t* out_len);
extern uint8_t DNSXsl_Response(uint8_t* pInBuf,uint8_t len,uint8_t* pIpBuf);
