/**
  ******************************************************************************
  * @file    Bsp_BH1750.h 
  * @author  徐松亮 许红宁(5387603@qq.com)
  * @version V1.0.0
  * @date    2018/01/01
  * @brief   bottom-driven -->   基于BH1750的照度传感器.
  * @note    
  * @verbatim
    
 ===============================================================================
                     ##### How to use this driver #####
 ===============================================================================
   1,    适用芯片
         STM      :  STM32F1  STM32F4
         Nordic   :  Nrf51    Nrf52
   2,    移植步骤
   3,    验证方法
   4,    使用方法
   5,    其他说明
  @endverbatim      
  ******************************************************************************
  * @attention
  *
  * GNU General Public License (GPL) 
  *
  * <h2><center>&copy; COPYRIGHT 2017 XSLXHN</center></h2>
  ******************************************************************************
  */
//-------------------------------------------------------------------------------
#ifndef __BSP_BH1750_H
#define __BSP_BH1750_H
//-------------------加载库函数------------------------------
#include "includes.h"
//-------------------接口宏定义(硬件相关)--------------------
//-------------------接口宏定义(硬件无关)--------------------
// 器件地址
#define BSP_BH1750_ADDR       0x46
// 寄存器地址
//-------------------接口函数--------------------------------
extern uint8_t BspBH1750_Init(void);
extern uint8_t BspBH1750_Read(uint16_t *p_ALS);
extern void BspBH1750_DebugTest_100ms(void);
extern void BspBH1750_DebugTestOnOff(uint8_t OnOff);
//-------------------------------------------------------------------------------
#endif