/**
  ******************************************************************************
  * @file    Bsp_Bmp180.h 
  * @author  徐松亮 许红宁(5387603@qq.com)
  * @version V1.0.0
  * @date    2018/01/01
  * @brief   bottom-driven -->   基于Bmp180的温度气压海拔传感器.
  * @note    
  * @verbatim
    
 ===============================================================================
                     ##### How to use this driver #####
 ===============================================================================
   1,    适用芯片
         STM      :  STM32F1  STM32F4
         Nordic   :  Nrf51    Nrf52
   2,    移植步骤
   3,    验证方法
   4,    使用方法
   5,    其他说明
  @endverbatim      
  ******************************************************************************
  * @attention
  *
  * GNU General Public License (GPL) 
  *
  * <h2><center>&copy; COPYRIGHT 2017 XSLXHN</center></h2>
  ******************************************************************************
  */
//-------------------------------------------------------------------------------
#ifndef __BSP_BMP180_H
#define __BSP_BMP180_H
//-------------------加载库函数------------------------------
#include "includes.h"
//-------------------接口宏定义(硬件相关)--------------------
//-------------------接口宏定义(硬件无关)--------------------
//精度选择(0-3)
#define BSP_BMP180_OSS 3
#define BSP_BMP180_ADDR             0xEE
//-------------------接口函数--------------------------------
uint8_t BspBmp180_Read(int16_t *pTemp,uint32_t *pAirPressure,int16_t *pAltitude);
void BspBmp180_DebugTest_100ms(void);
void BspBmp180_DebugTestOnOff(uint8_t OnOff);
//-------------------------------------------------------------------------------
#endif
