/*
***********************************************************************************
*                    作    者: 徐松亮
*                    更新时间: 2015-06-03
***********************************************************************************
*/
#ifndef __UCTSK_COMM_PC_H
#define __UCTSK_COMM_PC_H
//-------------------加载库函数------------------------------
#include "includes.h"
//-------------------------------------------------------------------------------接口宏定义
//串口端口号,在uart.c有宏判断,目前只支持1或2或3
#define UCTSK_COMM_PC_UART  3
//-------------------------------------------------------------------------------接口常量
//-------------------------------------------------------------------------------接口变量
//调试-->有效收发计数值
//extern uint32_t UctskCommPc_TxCount;
//extern uint32_t UctskCommPc_RxCount;
//-------------------------------------------------------------------------------接口函数
extern void  App_CommPcTaskCreate (void);
extern uint8_t uctsk_CommPc_Rx(uint8_t* pbuf, uint16_t len);
extern void CommPc_DebugTestOnOff(uint8_t OnOff);
extern void CommPc_Result_DebugTestOnOff(uint8_t OnOff);
extern void uctsk_CommPc_1ms(void);
#endif

//---------------------END-------------------------------------------------------

